Tekla Open API Reference for Tekla Structures 2025
FacetedBrep Constructor
Overload List
Name | Description
FacetedBrep(Vector[], Int32[][], IDictionary<Int32, Int32[][]>)
 Initializes a new instance of the FacetedBrep class.
FacetedBrep(Vector[], Int32[][], IDictionary<Int32, Int32[][]>, IList<IndirectPolymeshEdge>)
 Initializes a new instance of the FacetedBrep class.
Top
See Also
Reference
FacetedBrep Class
Tekla.Structures.Geometry3d Namespace